In [3]:
# Importing Libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt  

# Loading Data
dataset = load_dataset('lukebarousse/data_jobs')
datajobs = dataset['train'].to_pandas()

# Data Cleanup
datajobs['job_posted_date'] = pd.to_datetime(datajobs['job_posted_date'])

In [4]:
datajobs[pd.notna(datajobs["salary_year_avg"])] ["salary_year_avg"]

28        109500.0
77        140000.0
92        120000.0
100       228222.0
109        89000.0
            ...
785624    139216.0
785641    150000.0
785648    221875.0
785682    157500.0
785692    157500.0
Name: salary_year_avg, Length: 22003, dtype: float64

In [ ]:
datajobs.apply(datajobs["salary_year_avg"])

In [7]:
new_data = datajobs [pd.notna(datajobs["salary_year_avg"])].copy()

In [13]:
def projected_salary(salary):
    return salary * 1.03

new_data["salary_year_inflated"] = new_data["salary_year_avg"].apply(func = projected_salary)

new_data [["salary_year_avg", "salary_year_inflated"]].head(5)

     salary_year_avg  salary_year_inflated
28          109500.0             112785.00
77          140000.0             144200.00
92          120000.0             123600.00
100         228222.0             235068.66
109          89000.0              91670.00

In [15]:
new_data ['salary_year_inflated'] = new_data ["salary_year_avg"].apply(lambda salary: salary * 1.03)

new_data [["salary_year_avg", "salary_year_inflated"]].head(5)

     salary_year_avg  salary_year_inflated
28          109500.0             112785.00
77          140000.0             144200.00
92          120000.0             123600.00
100         228222.0             235068.66
109          89000.0              91670.00

In [28]:
import ast

ast.literal_eval(datajobs ["job_skills"][1])

def conversion_skills(skills):
    if pd.notna(skills):
        return ast.literal_eval(skills)

datajobs ["job_skills"] = datajobs['job_skills'].apply(conversion_skills)

ValueError: malformed node or string: ['r', 'python', 'sql', 'nosql', 'power bi', 'tableau']

In [32]:
def projected_salary(row):
    if "Senior" in row["job_title_short"]:
        return row["salary_year_avg"] * 1.05
    else: 
        return row["salary_year_avg"] * 1.03

new_data ["salary_year_inflated"] = new_data.apply(projected_salary, axis = 1)

new_data [["job_title_short", "salary_year_avg", "salary_year_inflated"]].head(20)

          job_title_short  salary_year_avg  salary_year_inflated
28         Data Scientist         109500.0             112785.00
77          Data Engineer         140000.0             144200.00
92          Data Engineer         120000.0             123600.00
100        Data Scientist         228222.0             235068.66
109          Data Analyst          89000.0              91670.00
116        Data Scientist         114000.0             117420.00
146         Data Engineer         129500.0             133385.00
180          Data Analyst          90250.0              92957.50
212        Data Scientist         157500.0             162225.00
257        Data Scientist         103128.0             106221.84
307         Data Engineer         185000.0             190550.00
339         Data Engineer         195000.0             200850.00
380         Data Engineer          97500.0             100425.00
388         Data Engineer          89000.0              91670.00
410          Data Analyst         133285.0             137283.55
450        Data Scientist         157500.0             162225.00
495  Senior Data Engineer         168500.0             176925.00
520      Business Analyst          63000.0              64890.00
545         Data Engineer          80000.0              82400.00
571         Data Engineer         110000.0             113300.00